app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages"
SELECT COUNT(*) FROM "pages"
---
  def index
    @pages=Page.all

INSERT INTO "pages" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "初始化"], ["created_at", "2015-12-01 15:40:36.826941"], ["updated_at", "2015-12-01 15:40:36.826941"]]
UPDATE "pages" SET "title" = ?, "finish" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["title", "林雨新"], ["finish", "f"], ["updated_at", "2015-12-02 13:30:23.424825"], ["id", 3]]
---
  def create
    @page = Page.create(page_params)
    @page.title = current_user.master.name
    @page.finish = false
    if @page.save

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pages" SET "finish" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["finish", "t"], ["updated_at", "2015-12-02 13:36:12.661642"], ["id", 3]]
UPDATE "users" SET "score" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["score", 500], ["updated_at", "2015-12-02 13:04:21.336775"], ["id", 1]]
---
  def update
   @page = Page.find(params[:id])
   @page.update(page_params)
   current_user.update_attribute(:score, current_user.score + @page.score)